---
type: Frame
namespace: Autodesk.Revit.DB
version: 2024
members: 13
tags: [revit-api, class]
---

# Frame

`Autodesk.Revit.DB.Frame` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | Frame | — | `` |
| Constructor | Frame | 2012 | `public Frame ()` |
| Method | CanDefineRevitGeometry | 2017 | `public static bool CanDefineRevitGeometry ( Frame frameOfReference )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsOrthogonal | 2012 | `public bool IsOrthogonal ()` |
| Method | IsOrthonormal | 2012 | `public bool IsOrthonormal ()` |
| Method | IsRightHanded | 2012 | `public bool IsRightHanded ()` |
| Method | Transform | 2012 | `public void Transform ( Transform trf )` |
| Property | BasisX | 2012 | `public XYZ BasisX { get ; set ; }` |
| Property | BasisY | 2012 | `public XYZ BasisY { get ; set ; }` |
| Property | BasisZ | 2012 | `public XYZ BasisZ { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Origin | 2012 | `public XYZ Origin { get ; set ; }` |